modules/jemacs_version_control_lp.org
#+TITLE: jemacs-version-control.el
#+PROPERTY: header-args:emacs-lisp :tangle ./jemacs-version-control.el :mkdirp yes

* setup

  #+begin_src emacs-lisp
    ;;; mycraft --- Summary  -*- lexical-binding: t; -*-
    ;;; Copyright (C) 2020 mycraft maintainers
    ;;; Author: Jing
    ;;; package --- mycraft
    ;;; Commentary:

    ;;; Code:


  #+end_src

* git version control

  Maybe we can consider to use [[https://github.com/Artawower/blamer.el][another blame tool]]
  ENHANCE: adjust the pop ui
  #+begin_src emacs-lisp
    (use-package git-messenger
      :defer t
      :custom
      (git-messenger:show-detail t)
      (git-messenger:use-magit-popup t))

    (use-package transient
      :init
      (unload-feature 'transient t))

    ;; (use-package transient
    ;;   :config
    ;;   (progn (unload-feature 'transient t) (require 'transient)))


    (use-package magit
      :defer 2
      :after transient
      :custom
      ((magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
       (magit-repository-directories
        '(("~/Desktop/data_platform" . 1)
          ("~/Desktop/cdp-cache" . 1)
          ("~/Desktop/ansible-playground" . 1)
          ("~/Desktop/go-playground" . 1)
          ("~/Desktop/spacemacs-private" . 1)))))

    (use-package forge
      :defer 2
      :after magit)

    (use-package code-review
      :defer 2
      :after forge)
  #+end_src

** get pull request url from magit process buffer

   #+begin_src emacs-lisp
     (defun get-pull-request-uri ()
       (interactive)
       (save-excursion
         (with-current-buffer (magit-process-buffer t)
           (goto-char (point-max))
           (re-search-backward "^remote:\s*\\(https?://.*\\)+?$")
           ;; it seems that match-string-no-properties will get nothing if
           ;; you switch buffer after re-search-backward
           (let ((uri (match-string-no-properties 1)))
             (message "copy pull request: %s to clipboard" uri)
             (kill-new uri)))))

   #+end_src

* ediff

  #+begin_src emacs-lisp
    (use-package ediff
      :defer t
      :after winner
      :hook
      (ediff-quit . winner-undo)
      :custom
      (ediff-window-setup-function 'ediff-setup-windows-plain)
      (ediff-split-window-function 'split-window-horizontally))
  #+end_src

* diff-hl

  I've check this. It seems to set =magit-post-refresh-hook= is enough.

  #+begin_src emacs-lisp :tangle no
    (add-hook 'magit-pre-refresh-hook 'diff-hl-magit-pre-refresh) ;; no need
  #+end_src

  #+begin_src emacs-lisp
    (use-package diff-hl
      :defer 1
      :init
      (add-hook 'magit-post-refresh-hook 'diff-hl-magit-post-refresh)
      :config
      (global-diff-hl-mode))
  #+end_src

* smerge

  #+begin_src emacs-lisp
    (defun repeat-which-key-popup (keymap)
      (if keymap
          (which-key--create-buffer-and-show
           nil (symbol-value keymap))
        (which-key--hide-popup)))

    (setq repeat-echo-function #'repeat-which-key-popup)

    (defun repeatize (keymap)
        "Add `repeat-mode' support to a KEYMAP."
        (map-keymap
         (lambda (_key cmd)
           (when (symbolp cmd)
             (put cmd 'repeat-map keymap)))
         (symbol-value keymap)))

    (use-package smerge-mode
      :straight (:type built-in)
      :config
      (repeatize 'smerge-basic-map))
  #+end_src

so you don't have to type C-c ^ over and over leading to madness

* provide package

  #+begin_src emacs-lisp
    (provide 'jemacs-version-control)
    ;;; jemacs-version-contorl.el ends here
  #+end_src
